Revit 2027 API
SymbolGeometryId.SymbolId Property
 The id of the symbol which contains the shared geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SymbolId { get; }
Public ReadOnly Property SymbolId As ElementId
	Get
public:
property ElementId^ SymbolId {
	ElementId^ get ();
}
member SymbolId : ElementId with get
Property Value
ElementId
See Also
Reference
SymbolGeometryId Class
Autodesk.Revit.DB Namespace